Repository: Yassineka99/flutter_pfe
Catalog: lib/l10n/intl_*.arb
Languages: ar

# settingsTitle
source: Settings
ar: الإعدادات

source: Take photo
ar: التقاط صورة

source: Choose from gallery
ar: اختيار من المعرض

source: Select Language
ar: اختر اللغة

source: Admin
ar: المسؤول

source: Manager
ar: المدير

source: Worker
ar: العامل

source: Dark Theme
ar: الوضع الداكن

source: Light Theme
ar: الوضع الفاتح

source: Log Out
ar: تسجيل الخروج

source: English
ar: الإنجليزية

source: French
ar: الفرنسية

source: German
ar: الألمانية

source: Spanish
ar: الإسبانية

source: Russian
ar: الروسية

source: Arabic
ar: العربية

source: Dashboard
ar: لوحة التحكم

source: Users
ar: المستخدمون

source: Workflows
ar: سير العمل

source: Settings
ar: الإعدادات

source: Error loading users
ar: حدث خطأ أثناء تحميل المستخدمين

source: Assigned Processes
ar: العمليات المخصصة

source: No assigned processes
ar: لا توجد عمليات مخصصة

source: No users found
ar: لم يتم العثور على مستخدمين

source: Unknown Role
ar: دور غير معروف

source: Add user
ar: إضافة مستخدم

source: Name
ar: الاسم

source: requiredField
ar: حقل مطلوب

source: Email
ar: البريد الإلكتروني

source: Invalid Email
ar: بريد إلكتروني غير صالح

source: Phone
ar: رقم الهاتف

source: Password
ar: كلمة المرور

source: Password Length
ar: طول كلمة المرور

source: Role
ar: الدور

source: cancel
ar: إلغاء

source: Error Creating User
ar: حدث خطأ أثناء إنشاء المستخدم

source: Save
ar: حفظ

source: by Name
ar: حسب الاسم

source: by Role
ar: حسب الدور

source: By Max Finished
ar: حسب الحد الأقصى للمنجز

# errorLoadingProcesses
source: Error loading Sub Processes
ar: حدث خطأ أثناء تحميل العمليات الفرعية

# assignedSubProcess
source: Assigned Sub Processes
ar: العمليات الفرعية المخصصة

source: No Assigned Sub Processes
ar: لا توجد عمليات فرعية مخصصة

# userAddedSuccess
source: User added successfully!
ar: تمت إضافة المستخدم بنجاح!

source: Users List
ar: قائمة المستخدمين

source: Send Notification
ar: إرسال إشعار

source: Message
ar: رسالة

source: Send
ar: إرسال

source: Notification Sent Successfully
ar: تم إرسال الإشعار بنجاح

source: Error Sending Notification
ar: حدث خطأ أثناء إرسال الإشعار

source: Notifications
ar: الإشعارات

source: No Notifications
ar: لا توجد إشعارات

source: Status
ar: الحالة

source: Close
ar: إغلاق

source: Mark All Read
ar: تمييز الكل كمقروء

source: Add Workflow
ar: إضافة سير عمل

source: Edit Workflow
ar: تعديل سير العمل

source: Delete Workflow
ar: حذف سير العمل

# deleteWorkflowConfirmation
source: Confirm Deleting Workflow
ar: تأكيد حذف سير العمل

source: Delete
ar: حذف

source: Success
ar: نجاح

source: Error
ar: خطأ

source: No Workflows
ar: لا توجد سير عمل

source: Associated Processes
ar: العمليات المرتبطة

source: Processes
ar: العمليات

source: Created
ar: تم الإنشاء

source: Started
ar: بدأ

source: Finished
ar: انتهى

source: Unknown
ar: غير معروف

source: Sub Processes
ar: العمليات الفرعية

source: Sign Report
ar: توقيع التقرير

source: Clear
ar: مسح

source: Confirm
ar: تأكيد

# provideSignature
source: Please provide a signature
ar: يرجى تقديم توقيع

source: Process Name Required
ar: اسم العملية مطلوب

# processesAddedSuccess
source: Process added Successfully
ar: تمت إضافة العملية بنجاح

source: Add Processes
ar: إضافة عمليات

source: Process Name
ar: اسم العملية

source: Add Another Process
ar: إضافة عملية أخرى

source: Save all Processes
ar: حفظ جميع العمليات

# addProcessesQuestion
source: Add Process Question
ar: إضافة سؤال العملية

# addProcessesToWorkflow
source: Add Process to workflow
ar: إضافة عملية إلى سير العمل

source: Yes
ar: نعم

source: Select At Least One User
ar: يرجى اختيار مستخدم واحد على الأقل

source: Sub Process Created
ar: تم إنشاء العملية الفرعية

# errorOccurred
source: errorOccured
ar: حدث خطأ

source: Add Sub Process
ar: إضافة عملية فرعية

source: Sub Process Name
ar: اسم العملية الفرعية

source: Select Users
ar: اختر المستخدمين

source: Do You Want To Add a Process ?
ar: هل تريد إضافة عملية؟

source: Generating Report
ar: جارٍ إنشاء التقرير

# pleaseWaitpdf
source: Please wait while we prepare your document
ar: يرجى الانتظار أثناء إعداد المستند الخاص بك

source: Error generating report
ar: حدث خطأ أثناء إنشاء التقرير

# showAllWorkflows
source: show me all workflows
ar: أرني جميع سير العمل

source: list workflows
ar: سرد سير العمل

source: what workflows
ar: ما هي سير العمل

source: view workflows
ar: عرض سير العمل

source: display workflows
ar: عرض سير العمل

source: see workflows
ar: رؤية سير العمل

source: existing workflows
ar: سير العمل الموجودة

source: hi
ar: مرحبًا

source: hello
ar: أهلاً

source: hey
ar: سلام

source: good morning
ar: صباح الخير

source: good afternoon
ar: مساء الخير

source: good evening
ar: مساء النور

# howCanIassistWithYourWorflowsToday
source: How can I assist with your workflows today?
ar: كيف يمكنني مساعدتك في سير العمل اليوم؟

# hellowThereWhatWorkflowTasksShallWeTackleTogether
source: Hello there! What workflow tasks shall we tackle together?
ar: مرحبًا! ما هي مهام سير العمل التي يجب أن نتعامل معها معًا؟

source: Hi! Ready to streamline your processes. What's on your mind?
ar: أهلاً! مستعد لتبسيط عملياتك. ما الذي يدور في ذهنك؟

source: I'm here to help with your workflow needs.
ar: أنا هنا لمساعدتك في احتياجات سير العمل الخاصة بك.

source: thanks
ar: شكرًا

source: thank you
ar: شكرًا لك

source: appreciate
ar: أقدر

source: grateful
ar: ممتن

# yourareverywelcome
source: You're very welcome! Always happy to help with your workflows.
ar: على الرحب والسعة! دائمًا سعيد بمساعدتك في سير العمل.

# myPlesure
source: My pleasure! Let me know if there's anything else you need.
ar: بكل سرور! أخبرني إذا كنت بحاجة إلى أي شيء آخر.

# noProblem
source: No problem at all! I'm here whenever you need workflow assistance.
ar: لا مشكلة على الإطلاق! أنا هنا عندما تحتاج إلى مساعدة في سير العمل.

# gladicouldhelp
source: Glad I could help! Don't hesitate to ask if more questions come up.
ar: سعيد أنني استطعت المساعدة! لا تتردد في السؤال إذا كانت لديك المزيد من الأسئلة.

source: create
ar: إنشاء

source: edit
ar: تعديل

source: remove
ar: إزالة

source: update
ar: تحديث

source: rename
ar: إعادة تسمية

source: add
ar: إضافة

source: workflow
ar: سير العمل

source: process
ar: عملية

source: sub-process
ar: عملية فرعية

source: step
ar: خطوة

source: task
ar: مهمة

# createWorkflowPrompt
source: I'd be happy to create a new workflow. What would you like to name it?
ar: سأكون سعيدًا بإنشاء سير عمل جديد. ما الاسم الذي تريده؟

# workflowCreated
source: All set! I've created the {name} workflow for you. Would you like to add processes to it now?
ar: تم! لقد قمت بإنشاء سير العمل {name} لك. هل ترغب في إضافة عمليات إليه الآن؟

# renameWorkflowPrompt
source: I'd be happy to rename a workflow. Which workflow should I update and what should I rename it to?
ar: يسعدني إعادة تسمية سير العمل. أي سير عمل يجب أن أعدل وما الاسم الجديد له؟

# workflowNotFound
source: Hmm, I couldn't find a workflow named {oldName}. Could you double-check the name?
ar: لم أتمكن من العثور على سير عمل باسم {oldName}. هل يمكنك التحقق من الاسم؟

# workflowRenamed
source: Got it! I've renamed the workflow from {oldName} to {newName}. What would you like to do next?
ar: فهمت! لقد أعدت تسمية سير العمل من {oldName} إلى {newName}. ماذا تريد أن تفعل بعد ذلك؟

# deleteWorkflowPrompt
source: I can help delete a workflow. Which workflow should I remove?
ar: يمكنني مساعدتك في حذف سير العمل. أي سير عمل يجب أن أزيل؟

# workflowDeleteNotFound
source: I couldn't find a workflow named {name}. Could you check the name and try again?
ar: لم أتمكن من العثور على سير عمل باسم {name}. هل يمكنك التحقق من الاسم والمحاولة مرة أخرى؟

# workflowDeleted
source: Done! I've deleted the {name} workflow. Let me know if you'd like to create a new one.
ar: تم! لقد حذفت سير العمل {name}. أخبرني إذا كنت ترغب في إنشاء واحد جديد.

# workflowTaskComplete
source: I've taken care of that workflow task for you. Is there anything else you'd like me to do?
ar: لقد قمت بهذه المهمة من سير العمل لك. هل هناك أي شيء آخر تريدني أن أفعله؟

# workflowError
source: Oops! I ran into a problem: {error}. Could you try again or give me more details?
ar: عذرًا! واجهت مشكلة: {error}. هل يمكنك المحاولة مرة أخرى أو إعطائي المزيد من التفاصيل؟

# addProcessPrompt
source: I can add a new process. What would you like to name it?
ar: يمكنني إضافة عملية جديدة. ما الاسم الذي تريده؟

# whichWorkflowPrompt
source: Which workflow should I add this process to?
ar: إلى أي سير عمل يجب أن أضيف هذه العملية؟

# workflowMatchNotFound
source: I couldn't find a workflow matching {workflowName}. Here are your existing workflows:
ar: لم أتمكن من العثور على سير عمل مطابق لـ {workflowName}. هذه هي سير العمل الموجودة لديك:

# multipleWorkflowsFound
source: I found multiple workflows matching {workflowName}. Please be more specific.
ar: لقد وجدت عدة سير عمل تطابق {workflowName}. يرجى أن تكون أكثر تحديدًا.

# matchingWorkflows
source: Matching workflows: {workflows}
ar: سير العمل المطابقة: {workflows}

# processExists
source: The process {processName} already exists in workflow {workflowName}. Would you like to add a sub-process instead?
ar: العملية {processName} موجودة بالفعل في سير العمل {workflowName}. هل ترغب في إضافة عملية فرعية بدلاً من ذلك؟

# processAdded
source: Done! I've added the {processName} process to the {workflowName} workflow. Would you like to add sub-processes now?
ar: تم! لقد أضفت العملية {processName} إلى سير العمل {workflowName}. هل ترغب في إضافة عمليات فرعية الآن؟

# processTaskComplete
source: I've handled that process task for you. What would you like to do next?
ar: لقد قمت بهذه المهمة من العملية لك. ماذا تريد أن تفعل بعد ذلك؟

# processError
source: Hmm, I couldn't complete that process task. The error was: {error}
ar: لم أتمكن من إكمال مهمة العملية هذه. كان الخطأ: {error}

source: named
ar: اسمه

source: called
ar: يسمى

source: with name
ar: بالاسم

# fora
source: for
ar: لـ

source: and
ar: و

source: how are you
ar: كيف حالك

source: your name
ar: اسمك

# howAreYouResponse
source: I'm just a digital assistant, but I'm functioning at 100%! Ready to help you with your workflows.
ar: أنا مجرد مساعد رقمي، لكنني أعمل بنسبة 100%! جاهز لمساعدتك في سير العمل.

# assistantName
source: I'm your Workflow Assistant, but you can call me Flow if you'd like!
ar: أنا مساعد سير العمل الخاص بك، لكن يمكنك مناداتي بـ"فلو" إذا أردت!

source: who made you
ar: من صنعك

source: who created you
ar: من أنشأك

# creatorResponse
source: I was created by Yassine Kadri to help you manage workflows more efficiently. My purpose is to make your work easier!
ar: لقد قام ياسين قدري بإنشائي لمساعدتك في إدارة سير العمل بكفاءة أكبر. هدفي هو جعل عملك أسهل!

source: help
ar: مساعدة

source: what can you do
ar: ماذا يمكنك أن تفعل

# capabilitiesResponse
source: I can help you create, edit, and manage workflows and processes. Would you like me to explain how?
ar: يمكنني مساعدتك في إنشاء وتعديل وإدارة سير العمل والعمليات. هل تريد أن أشرح لك كيف؟

# imnotintierlysure
source: I'm not entirely sure I follow, but I'm happy to help with workflow management!
ar: لست متأكدًا تمامًا من أنني فهمت، لكنني سعيد بمساعدتك في إدارة سير العمل!

# thatsinteresting
source: That's interesting! I'm best at helping with workflows and processes though.
ar: هذا مثير للاهتمام! لكنني أفضل في المساعدة في سير العمل والعمليات.

# imstilllearningcasualconversation
source: I'm still learning casual conversation. Could you ask me about workflows?
ar: ما زلت أتعلم المحادثة العادية. هل يمكنك أن تسألني عن سير العمل؟

# letmethinkaboutthat
source: Let me think about that... In the meantime, I can help you create or manage workflows!
ar: دعني أفكر في ذلك... في غضون ذلك، يمكنني مساعدتك في إنشاء أو إدارة سير العمل!

# imnotcertainiunderstood
source: I'm not certain I understand. Could you rephrase that or ask about workflows?
ar: لست متأكدًا من أنني فهمت. هل يمكنك إعادة الصياغة أو السؤال عن سير العمل؟

# helpMessage
source: Here's how I can assist you with workflows: *Workflow Management* - "Create a new workflow for order processing" - "Edit the 'Order Processing' workflow to 'Order Management'" - "Delete the old test workflow" - "Show me all workflows" *Process Management* - "Add a payment process to the order workflow" - "Create a sub-process for credit checks" - "Remove the test process from the demo workflow" *General Help* - "What can you do?" - "How does this work?" - "Explain workflows to me" You can ask naturally - I'll do my best to understand!
ar: إليك كيف يمكنني مساعدتك في سير العمل: *إدارة سير العمل* - "إنشاء سير عمل جديد لمعالجة الطلبات" - "تعديل سير العمل 'معالجة الطلبات' إلى 'إدارة الطلبات'" - "حذف سير العمل التجريبي القديم" - "عرض جميع سير العمل" *إدارة العمليات* - "إضافة عملية دفع إلى سير العمل الخاص بالطلب" - "إنشاء عملية فرعية للتحقق من الائتمان" - "إزالة العملية التجريبية من سير العمل التجريبي" *مساعدة عامة* - "ماذا يمكنك أن تفعل؟" - "كيف يعمل هذا؟" - "اشرح لي سير العمل" يمكنك أن تسأل بطريقة طبيعية - سأبذل قصارى جهدي لفهمك!

# noWorkflowsYet
source: You don't have any workflows yet. Would you like me to create one for you?
ar: ليس لديك أي سير عمل بعد. هل تريد أن أنشئ واحدًا لك؟

# workflowsListHeader
source: Here are your
ar: هذه هي

# workflowsListPrompt
source: Would you like to work with any of these?
ar: هل ترغب في العمل مع أي من هذه؟

# fetchWorkflowsError
source: Sorry, I couldn't fetch your workflows. The error was: {error}
ar: عذرًا، لم أتمكن من جلب سير العمل الخاص بك. كان الخطأ: {error}

source: as
ar: كـ

source: Typing ...
ar: يكتب...

source: Thinking
ar: يفكر

# helloImAssitant
source: Hello! I'm your workflow assistant. How can I help you today?
ar: مرحبًا! أنا مساعد سير العمل الخاص بك. كيف يمكنني مساعدتك اليوم؟

source: Microphone Permission Required
ar: الإذن باستخدام الميكروفون مطلوب

source: Speech Recognition Not Available
ar: الاعتراف الصوتي غير متاح

source: Workflow Assistant
ar: مساعد سير العمل

source: How Can I Help
ar: كيف يمكنني المساعدة

source: Listening
ar: يستمع

source: Type your message
ar: اكتب رسالتك

# tor
source: to
ar: إلى

# news
source: new
ar: جديد
